; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
; params: satgen 496430 2 2 4 6 4
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	spectrograph1 - mode
	image3 - mode
	thermograph2 - mode
	thermograph0 - mode
	GroundStation1 - direction
	GroundStation2 - direction
	Star3 - direction
	Star4 - direction
	Star5 - direction
	GroundStation0 - direction
	Phenomenon6 - direction
	Planet7 - direction
	Star8 - direction
	Planet9 - direction
)
(:init
	(supports instrument0 thermograph0)
	(calibration_target instrument0 Star3)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon6)
	(supports instrument1 spectrograph1)
	(supports instrument1 image3)
	(supports instrument1 thermograph2)
	(calibration_target instrument1 Star4)
	(supports instrument2 thermograph0)
	(supports instrument2 image3)
	(supports instrument2 thermograph2)
	(calibration_target instrument2 GroundStation0)
	(calibration_target instrument2 Star5)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation2)
)
(:goal (and
	(pointing satellite0 Planet9)
	(have_image Phenomenon6 thermograph2)
	(have_image Planet7 spectrograph1)
	(have_image Star8 spectrograph1)
	(have_image Planet9 image3)
))

)

; plan
1. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 0 of 5
2. (turn_to satellite1 star8 groundstation2)
   deleted: (pointing satellite1 groundstation2)
   added: (pointing satellite1 star8)
   goals met: 0 of 5
3. (turn_to satellite0 planet9 phenomenon6)
   deleted: (pointing satellite0 phenomenon6)
   added: (pointing satellite0 planet9)
   goals met: 1 of 5
4. (turn_to satellite1 star4 star8)
   deleted: (pointing satellite1 star8)
   added: (pointing satellite1 star4)
   goals met: 1 of 5
5. (calibrate satellite1 instrument1 star4)
   added: (calibrated instrument1)
   goals met: 1 of 5
6. (turn_to satellite1 star8 star4)
   deleted: (pointing satellite1 star4)
   added: (pointing satellite1 star8)
   goals met: 1 of 5
7. (take_image satellite1 star8 instrument1 spectrograph1)
   added: (have_image star8 spectrograph1)
   goals met: 2 of 5
8. (turn_to satellite1 planet9 star8)
   deleted: (pointing satellite1 star8)
   added: (pointing satellite1 planet9)
   goals met: 2 of 5
9. (take_image satellite1 planet9 instrument1 image3)
   added: (have_image planet9 image3)
   goals met: 3 of 5
10. (turn_to satellite1 planet7 planet9)
   deleted: (pointing satellite1 planet9)
   added: (pointing satellite1 planet7)
   goals met: 3 of 5
11. (take_image satellite1 planet7 instrument1 spectrograph1)
   added: (have_image planet7 spectrograph1)
   goals met: 4 of 5
12. (turn_to satellite1 phenomenon6 planet7)
   deleted: (pointing satellite1 planet7)
   added: (pointing satellite1 phenomenon6)
   goals met: 4 of 5
13. (take_image satellite1 phenomenon6 instrument1 thermograph2)
   added: (have_image phenomenon6 thermograph2)
   goals met: 5 of 5
